Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཆོས་ཡང་དག་པར་སྡུད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Dharma Council

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཁང་པ་བརྩེགས་པ་དཔེ་མེད་པ། ནམ་མཁའི་སྤྱོད་ཡུལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དཀྱིལ་ཐ་མི་དད་པ་ཀུན་ནས་ཡངས་པ་རང་གི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་སྤྲུལ་པ། གནས་གསུམ་གྱི་མངོན་པར་འདུ་བྱེད་པ་དང་མི་འདྲ་བ། དཔེ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ།
en: The Blessed One was staying in an incomparable mansion that was so vast as to be indistinct from the center of the expanse of phenomena that extends throughout the domain of space. It was a miraculous emanation of his own accumulation of merit and wisdom, and it was unlike any contrived phenomena in the three worlds.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྨིན་པ། བསམ་གྱིས་མི་ཁྱབ་པ་ལས་བྱུང་བ་ན།
en: Completely beyond comparison, it was born from the Thus-Gone One’s inconceivable karmic ripening.

source: དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཕལ་ཆེར་དགྲ་བཅོམ་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ། གཉིས་ཀའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་ཤ་སྟག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་རྣམ་པར་དག་པ། ཏིང་ངེ་འཛིན་ལ་རྟག་ཏུ་སྤྱོད་ཡུལ་བ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་སྤྱོད་ཡུལ་ལ་གནས་པ།
en: He resided there together with a great assembly of 1,250 monks, most of whom were arhats who had attained correct discernment, and all of whom were liberated from the two factors.

source: ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུས་མེད་པ་དམ་པའི་ཕ་རོལ་དུ་ཕྱིན་པ། བྱང་ཆུབ་སེམས་དཔའི་བརྣག་པ་དང་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ། བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ཤིན་ཏུ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། མཐར་ཐུག་པའི་གནས་བཅུ་ཐོབ་པ། ཡོན་ཏན་གྱི་རྒྱན་དཔག་ཏུ་མེད་པས་བརྒྱན་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་བཟོད་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ཤ་སྟག་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: Also present were exceedingly pure bodhisattva great beings who were constantly in samādhi, who maintained the scope and referents of omniscient wisdom, who reached the culmination of the sublime expanse of phenomena that is without center or edge, who had perfected all of the aims and intentions of a bodhisattva, who had mastered the realization of all the bodhisattva powers, who had attained the ten culminations, who were adorned with infinite ornaments of good qualities, and who had mastered the realization of the samādhi, dhāraṇī, patience, and correct discernments of a bodhisattva.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་གཟི་བརྗིད་ཆེ་བ་བརྒྱ་སྟོང་དང་། གཡོག་བརྒྱ་སྟོང་དུ་མ་དང་ཡང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: There were also hundreds of thousands of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, śakras, brahmās, and many hundreds of thousands of resplendent world guardians, along with many hundreds of thousands of attendants.

source: དེའི་ཚེ་ན་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་གོ་རིམས་ཀྱི་ཚུལ་གྱི་སྒོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་སྟོན་ཏོ། །འདི་ལྟ་སྟེ། འཕགས་པ་རྣམས་མཐོང་བས་དད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: On that occasion, the Blessed One was teaching the great approach to the Dharma called Entering the Gate of the Progressive Approach to All Dharmas: “By seeing the noble ones, one will attain faith.

source: དད་པ་ཐོབ་པས་དགེ་བའི་ཆོས་ལ་འདུན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: By attaining faith, one will aspire to virtuous qualities.

source: དགེ་བའི་ཆོས་ལ་འདུན་པས་རྒྱུན་དུ་ཆུད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: By aspiring to virtuous qualities, one will attain stream entry.

source: རྒྱུན་དུ་ཆུད་པ་ཐོབ་པས་དོན་རྙེད་པར་འགྱུར་རོ། །
en: By attaining stream entry, one will fulfill one’s purpose.

source: དོན་རྙེད་པས་བདག་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: By fulfilling one’s purpose, one will attain mastery.

source: བདག་པོ་ཐོབ་པས་སྦྱིན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: By attaining mastery, one will become generous.

source: སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Through being generous, one will attain great prosperity.

source: ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་ཐོབ་པར་འགྱུར་རོ། །
en: Through discipline, one will attain the higher realms.

source: བཟོད་པས་ཀུན་ཏུ་མཛེས་པར་འགྱུར་རོ། །
en: Through patience, one will become attractive in all ways.

source: བརྩོན་འགྲུས་ཀྱིས་མངོན་པར་ཤེས་པ་མྱུར་བར་འགྱུར་རོ། །
en: Through diligence, one will swiftly gain the higher cognitions.

source: བསམ་གཏན་གྱིས་སེམས་ལས་སུ་རུང་བར་འགྱུར་རོ། །
en: Through meditative stability, one’s mind will become pliable.

source: ཤེས་རབ་ཀྱིས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །
en: Through insight, one will rise above all worlds.

source: ཐབས་ཀྱིས་ཐམས་ཅད་ལས་འབྱུང་བར་འགྱུར་རོ། །
en: Through skillful means, one will adapt to any situation.

source: སྨོན་ལམ་གྱིས་ཚེགས་མེད་པར་འགྱུར་རོ། །
en: Through aspiration, one will face no difficulties.

source: སྟོབས་ཀྱིས་མི་ཚུགས་པར་འགྱུར་རོ། །
en: Through strength, one will be invulnerable.

source: ཡེ་ཤེས་ཀྱིས་འཇིག་རྟེན་ཐམས་ཅད་སྟོན་པར་འགྱུར་རོ། །
en: Through wisdom, one will teach in all the worlds.

source: མངོན་པར་འབྱུང་བས་འཕགས་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །
en: Through renunciation, one will attain nobility.

source: རབ་ཏུ་བྱུང་བས་གནོད་སེམས་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: By going forth, one will quell all harmful thoughts.

source: བསོད་སྙོམས་སྤྱོད་པས་ཁ་ན་མ་ཐོ་བ་མེད་པར་འགྱུར་རོ། །
en: By living on alms, one will become irreproachable.

source: དགོན་པ་ལ་གནས་པས་འཇིགས་པ་མེད་པར་འགྱུར་རོ། །
en: By living in solitude, one will become fearless.

source: ནང་དུ་ཡང་དག་འཇོག་པས་བསམ་གཏན་དང་། མངོན་པར་ཤེས་པ་དང་། ཚངས་པའི་གནས་པ་ཐོབ་པར་འགྱུར་རོ། །
en: And through inward composure, one will achieve meditative stability, the higher cognitions, and the brahmā states.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་པས་སོ་ས་ཡང་དག་པར་རིག་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “By examining the Dharma just as it was heard and by teaching it accurately, one will attain correct discernment.

source: དྲན་པ་ལ་མཁས་པས་གཟུངས་ཐོབ་པར་འགྱུར་རོ། །
en: Through expertise in mindfulness, one will attain dhāraṇī.

source: སྤོབས་པ་ལ་མཁས་པས་ཁྱད་པར་ལུང་སྟོན་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ། །
en: Through expertise in confident eloquence, one will attain the wisdom of accurate prophesy.

source: བློ་གྲོས་ལ་མཁས་པས་ཆོས་དང་དོན་རབ་ཏུ་དབྱེ་བའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ། །
en: Through skillful intelligence, one will attain the wisdom that discerns between phenomena and their meaning.

source: མོས་པ་ལ་མཁས་པས་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་རོ། །
en: Through expertise in dedication, one will attain fearlessness.

source: ཕུང་པོ་ལ་མཁས་པས་ཤེས་རབ་རབ་ཏུ་དབྱེ་བར་འགྱུར་རོ། །
en: Through expertise in the aggregates, one will develop discerning insight.

source: ཁམས་ལ་མཁས་པས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཕྲ་མོ་ཤེས་པས་རབ་ཏུ་འབྱེད་པར་འགྱུར་རོ། །
en: Through expertise in the elements, one will access the knowledge of subtle dependent arising.

source: སྐྱེ་མཆེད་ལ་མཁས་པས་ཕྱི་ནང་ལ་ཤིན་ཏུ་རྨོངས་པ་སྤོང་བར་འགྱུར་རོ། །
en: Through expertise in the sense bases, one will relinquish confusion regarding the internal and external.

source: བདེན་པ་ལ་མཁས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བར་འགྱུར་རོ། །
en: Through expertise in truth, one will not deceive any beings.

source: ཡིད་ལ་བྱེད་པ་ལ་མཁས་པས་སངས་རྒྱས་ཐམས་ཅད་མཉེས་པར་བྱེད་པར་འགྱུར་རོ། །
en: Through expertise in attention, one will please all the buddhas.

source: ཞི་གནས་ལ་མཁས་པས་སེམས་ཞི་བར་འགྱུར་རོ། །
en: Through expertise in meditative calm, the mind will be pacified.

source: ལྷག་མཐོང་ལ་མཁས་པས་སེམས་དུལ་བར་འགྱུར་རོ། །
en: And, through expertise in meditative insight, the mind will be tamed.

source: ང་རྒྱལ་མེད་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: “Without pride, one will perfect the wisdom of omniscience.

source: ཁེངས་པ་མེད་པས་ཡིད་རྟོན་པར་འགྱུར་རོ། །
en: Without arrogance, one will be trustworthy.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བས་དབང་གཅིག་པར་འགྱུར་རོ། །
en: By not deceiving any beings, one will have a singular power.

source: དམ་བཅས་པ་ལ་བརྟན་པས་ལྷ་དང་མི་མགུ་བར་བྱེད་པར་འགྱུར་རོ། །
en: Being firm in one’s commitments delights gods and humans.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པས་སྐྱེས་བུ་དམ་པའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: By acting just as one speaks, one will perfect the qualities of a sublime being.

source: ནང་དུ་སེམས་པས་བདེ་བར་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: Through introspection, one will easily comprehend things.

source: སེམས་འཆོས་པས་ཆོས་ཀྱི་རྒྱལ་སྲིད་ཐོབ་པར་འགྱུར་རོ། །
en: By improving the mind, one will attain the Dharma kingdom.

source: ལུས་བསྲུང་བ་དང་ལུས་ལ་མི་བལྟ་བས་སངས་རྒྱས་ཀྱི་སྐུ་ཐོབ་པར་འགྱུར་རོ། །
en: Protecting the body while disregarding it, one will attain the body of a buddha.

source: འཇམ་ཞིང་སྙན་ལ་ཕན་པར་སྨྲ་བས་ཚངས་པའི་སྒྲ་སྐད་སྒྲོགས་པའི་དབྱངས་ཐོབ་པར་འགྱུར་རོ། །
en: By speaking gently and pleasantly with altruistic intent, one will attain a voice that resounds in the melodious tones of Brahmā.

source: དཀོན་མཆོག་གསུམ་ལ་དད་པ་མི་ཕྱེད་པས་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: “Through undivided faith in the Three Jewels, one will attain the strength of knowing what is appropriate and inappropriate.

source: ཐམས་ཅད་དུ་ལེགས་པར་བྱ་བའི་ལས་བྱེད་པས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By always engaging in well-performed deeds, one will attain the strength of knowing the ripening of karma.

source: སེམས་ཅན་ཡེ་ཤེས་ཀྱི་ལམ་ལ་སྦྱོར་བ་དང་། ཕ་རོལ་མི་ཤེས་པ་ལ་མི་བརྙས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By connecting beings with the path of wisdom and not despising outsiders for their ignorance, one will attain the strength of knowing the supreme and ordinary sense faculties.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཕྲ་བ་ཁོང་དུ་ཆུད་པས་ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By comprehending subtle dependent arising, one will attain the strength of knowing beings’ varying dispositions.

source: སེམས་ཅན་ཐམས་ཅད་དཀོན་མཆོག་གསུམ་ལ་འཛུད་པ་དང་། མོས་པར་བྱེད་པས་མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By causing all beings to engage with and take an interest in the Three Jewels, one will attain the strength of knowing beings’ varying interests.

source: ཐམས་ཅད་དུ་སྤྱོད་ལམ་རྣམ་པར་མི་འཁྲུགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་ཆོས་སྟོན་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By always being imperturbable in conduct and by teaching the Dharma in a way that accords with every being, one will attain the strength of knowing the destinations of all paths.

source: སེམས་ཅན་བསམ་གཏན་གྱི་ལམ་ལ་སྦྱོར་བས་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By connecting beings with the path of meditative concentration, one will attain the strength of knowing the purification of the defilements affecting meditative concentration, samādhi, and meditative attainment, and of knowing how to overcome them.

source: སེམས་ཅན་ལམ་སྟོར་བ་རྣམས་ལ་ལམ་ཉེ་བར་སྟོན་པས་ལྷའི་མིག་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By showing the path to those beings who have lost their way, one will attain the strength of knowing the divine eye.

source: སེམས་ཅན་ཐམས་ཅད་ལ་དྲན་པ་རབ་ཏུ་སྦྱིན་པས་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By imparting mindfulness to all beings, one will attain the strength of knowledge of recollecting previous lives.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་བྱང་བའི་ལམ་ཉེ་བར་སྟོན་པས་ཟག་པ་ཟད་པ་མཁྱེན་པའི་སྟོབས་ཐོབ་པར་འགྱུར་རོ། །
en: By teaching the path of purification to all beings, one will attain the strength of knowing the exhaustion of contaminants.

source: སེམས་ཅན་མང་དུ་ཐོས་པ་ལ་སྦྱོར་བས་མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “By connecting beings with extensive learning, one will attain fearlessness.

source: སེམས་ཅན་ཐེག་པ་ཆེན་པོ་ལ་སྦྱོར་བས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཐོབ་པར་འགྱུར་རོ། །
en: By connecting beings with the Great Vehicle, one will attain the unique qualities of a buddha.

source: སྟོང་པ་ཉིད་སྒོམ་པས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤོང་བར་འགྱུར་རོ། །
en: By cultivating emptiness, one will eliminate the chain of habitual patterns.

source: མཚན་མ་མེད་པ་སྒོམ་པས་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ། །
en: By cultivating signlessness, one will attain unobscured wisdom regarding all phenomena.

source: སྨོན་པ་མེད་པ་སྒོམ་པས་ཆོས་ཐམས་ཅད་ལ་སོ་སོར་རྟོག་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ་ཞེས་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་གོ་རིམས་ཀྱི་སྒོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་སྟོན་ཏོ། །
en: And by cultivating wishlessness, one will attain the wisdom that discerns all phenomena.” This is what the Blessed One taught as the great Dharma discourse called Entering the Gate of the Progressive Approach to All Dharmas.

source: འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ཁང་པ་བརྩེགས་པའི་ནང་ན་གཡོག་མང་པོ་དང་གནས་ཤིང་འཁོད་དེ།
en: Present in that assembly inside the mansion were two bodhisattvas with their many servants.

source: གཅིག་ནི་རྩོམ་པ་མེད་ཅེས་བྱ། གཅིག་ནི་བློ་གྲོས་རྣམ་པར་གནོན་ཅེས་བྱའོ། །
en: One was named Nirārambha and the other Mativikrama.

source: དེ་གཉིས་དེར་འདུས་ནས་བློ་འདི་སྙམ་དུ་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པ་བློ་གྲོས་ཡངས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: They met and shared this thought: “There is a Dharma discourse of bodhisattvas called Vast Intelligence.”

source: བདག་ཅག་གིས་ཡང་དག་པར་བརྗོད་པར་བྱའོ་ཞེས་སྨྲས་ནས།
en: They then said aloud, “We should discuss it.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་འབྱུང་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: The bodhisattva great being Mativikrama then inquired of the bodhisattva great being Nirārambha, “Child of good family, how should bodhisattva great beings understand the arising of the thus-gone, worthy, completely perfect buddhas?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should bodhisattva great beings understand the essence of the thus-gone ones?

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གཞན་གྱི་རྐྱེན་གྱིས་འབྱུང་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the different conditions through which thus-gone ones arise?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གནས་པ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: Child of good family, how should bodhisattvas understand the state of the thus-gone ones?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: Child of good family, how should bodhisattvas understand the great final nirvāṇa of the thus-gone, worthy, completely perfect buddhas?

source: འཇུག་པ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the approach?

source: དཔེ་དང་འདྲ་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand examples and comparisons?

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་རྣམས་དུ་ཡོད་པར་ཁོང་དུ་ཆུད་པར་བྱ།
en: “Child of good family, how should bodhisattvas understand the different aspects of a buddha?

source: བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཐ་སྙད་དུ་སྟོན་པ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should bodhisattvas understand what the thus-gone, blessed, completely perfect buddhas teach conventionally?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་སྟོང་པ་ཉིད་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: Child of good family, how should bodhisattvas understand emptiness?

source: སྟོང་པ་ཉིད་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand opposition to emptiness?

source: བྱང་ཆུབ་སེམས་དཔས་སྟོང་པ་ཉིད་སྨྲ་བར་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should bodhisattvas understand those who follow the teachings on emptiness?

source: བྱང་ཆུབ་སེམས་དཔས་ཆོས་སྨྲ་བ་པོ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should bodhisattvas understand those who follow the Dharma?

source: དེ་རྣམས་ཀྱིས་ཆོས་སྨྲ་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the examples through which they promote the Dharma?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་འགྲོགས་པ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the ways bodhisattvas should not associate with others?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཕྲུལ་པ་ཆེན་པོ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the great emanation of bodhisattvas?

source: དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ།
en: How should they understand the ripening power of the virtues?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཟག་པ་མེད་པའི་དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཐོབ་པའི་དབང་བ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Child of good family, how should bodhisattvas understand the power of attaining the ripening of the undefiled virtues?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ཡང་དག་ཕུལ་འདི་དྲིས་པ་འདི་ལྟ་སྟེ།
en: When the bodhisattva great being Mativikrama finished speaking, the bodhisattva great being Nirārambha said to him, “Child of good family, you have asked about this exceedingly excellent Dharma discourse of bodhisattva great beings.

source: ཆོས་ཡང་དག་པར་བརྗོད་པ་བློ་གྲོས་རྒྱ་ཆེན་པོ་འདི་ནི་ཡང་དག་ཕུལ་གྱི་གཏམ་མོ། །
en: This Dharma discourse called Vast Intelligence is an exceedingly excellent account.

source: རིགས་ཀྱི་བུ་ཉོན་ཅིག་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་བློ་གྲོས་ཆེན་པོ་འདི་བཤད་པར་བྱའོ། །
en: Child of good family, listen as I explain, through the blessing of the Buddha, this Dharma discourse called Vast Intelligence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་འབྱུང་བ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand the arising of thus-gone, worthy, completely perfect buddhas through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རྩོམ་པའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀུན་ཆད་པའི་སྐྱེ་བར་འཇུག་པ་དང་། སེམས་དང་ཡིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་གནས་གྱུར་པ་ཐམས་ཅད་འཇུག་པ་དང་། སྐྱེ་བ་དང་། འཇིག་པ་ལས་ཕྱིར་ལྡོག་པའི་སྐྱེ་བ་དང་འཇིག་པ་འཇུག་པ་དང་། སྔོན་གྱི་མངོན་པར་འདུ་བྱེད་པའི་གནོད་པས་ནོན་པའི་རྣམ་པར་སྨིན་པ་ཐམས་ཅད་འཇུག་པ་དང་།
en: What are these ten?

source: ཆོས་ཀྱི་དབྱིངས་ཆགས་པ་མེད་པ་ཡོངས་སུ་སྦྱོང་བ་བསགས་པའི་བསོགས་པ་ཐམས་ཅད་དང་། སྨོན་ལམ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུས་བསྟན་པའི་སྟོན་པ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ཇི་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་དགེ་བའི་རྩ་བའི་ཤུགས་ཀྱིས་འཕངས་པའི་འཕེན་པ་ཐམས་ཅད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་རྒྱུ་འཐུན་པ་ཤིན་ཏུ་རྒྱས་པ་དང་། དུས་དང་གནས་དང་།
en: (1) The approach that disrupts all concepts of striving; (2) the approach of transforming the mind, thought, and the mind consciousness; (3) the approach in which birth and dissolution counter birth and dissolution; (4) the approach that completely ripens what has been suppressed by the harmful effects of previous karmic formations; (5) the complete gathering of requisites for purifying the expanse of phenomena that is free of attachment; (6) the complete revelation of teachings by means of countless millions of aspirations; (7) the blessings of the Buddha who has been blessed by all the thus-gone ones; (8) all the ways ripened roots of virtue provide an impetus; (9) the exceedingly vast flow of great love and compassion; and (10) arising in different forms depending on the influence of time, place, and the intentions, virtuous yearnings, and dispositions of beings.

source: སེམས་ཅན་གྱི་བསམ་པ་དང་དགེ་བ་ཡང་དག་པར་འདོད་པ་ཇི་ལྟ་བ་དང་། ལྷག་པའི་བསམ་པའི་དབང་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྣམ་པ་ཐ་དད་པར་འབྱུང་བ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་འབྱུང་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should understand the arising of the thus-gone, worthy, completely perfect buddhas through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand the essence of all the thus-gone, worthy, completely perfect buddhas through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རང་བཞིན་གྱིས་དྲི་མ་མེད་པའི་ཕྱིར་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དང་དབྱེར་མེད་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དང་། ཐམས་ཅད་དུ་སོང་བའི་ཕྱིར་ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་དང་།
en: What are these ten?

source: ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའི་ཕྱིར་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་ངོ་བོ་ཉིད་དང་། གཞན་གྱི་རྐྱེན་གྱི་དབང་གིས་ཞུགས་པའི་ཕྱིར་སྒྱུ་མ་དང་སྨིག་རྒྱུ་དང་ཆུ་ཟླ་དང་སྤྲུལ་པ་དང་བྲག་ཅ་དང་དྲི་ཟའི་གྲོང་ཁྱེར་དང་མགལ་མེ་བསྐོར་བའི་ངོ་བོ་ཉིད་དང་། རྫས་མེད་པའི་ཕྱིར་སྐྱེ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པའི་ངོ་བོ་ཉིད་དང་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་ངོ་བོ་ཉིད་དང་། རྒྱུན་མ་ཆད་པའི་ཕྱིར་སྔོན་གྱི་མཐར་མ་བྱུང་བ་དང་ལུས་མེད་པའི་ཕྱིར་ཕྱི་མའི་མཐར་མི་འཕོ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་མེད་པས་ད་ལྟར་བྱུང་བ་ལ་མི་གནས་པ་སྟེ།
en: (1) The essence of suchness, because they are naturally stainless; (2) the essence of the expanse of phenomena, because they are indivisible; (3) the essence of the limit of reality, because they are omnipresent; (4) the essence of emptiness, signlessness, and wishlessness, because they are devoid of essence; (5) the essence that is like an illusion, a mirage, the moon’s reflection in water, a magical creation, an echo, a city of gandharvas, and the circling of a firebrand, because they are instantiated through the power of external conditions; (6) the essence of birthlessness and nonarising, because they are immaterial; (7) the essence of the nature of all things, because they are naturally luminous; (8) never having arisen in the past, because they are an unbroken continuity; (9) not transferring into the future, because they are not physical; and (10) not existing in the present, because they are absent in the past and future.

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should thus understand the essence of the thus-gone, worthy, completely perfect buddhas through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་གཞན་གྱི་རྐྱེན་གྱིས་འབྱུང་བ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand the different conditions through which the thus-gone, worthy, completely perfect buddhas arise through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཀྱི་འབྲས་བུའི་ཕྱིར་བག་ཡོད་པའི་ས་བོན་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཕྱིར་ཤེས་རབ་དང་ཐབས་ཀྱིས་བསྐྱེད་པ་དང་།
en: What are these ten?
